# 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
def sum_and_multiplication(a, b):
    print(f'Сумма: {a + b}\nПроизведение: {a * b}')


sum_and_multiplication(a=int(input('Введите первое трехзначное число: ')),
                       b=int(input('Введите первое трехзначное число: ')))










